# RevitAPIPostEventArgs Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevitAPIPostEventArgs Class
Members See Also
---
The class is used as a base class for arguments of any post-event.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class RevitAPIPostEventArgs : RevitAPIEventArgs
```

Visual Basic
---
```text
Public Class RevitAPIPostEventArgs _
	Inherits RevitAPIEventArgs
```

Visual C++
---
```text
public ref class RevitAPIPostEventArgs : public RevitAPIEventArgs
```

# Remarks
A post-event is the event raised after execution of the process that was related with the event.
# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPostEventArgs Autodesk.Revit.DB.Events..::..DocumentClosedEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPostDocEventArgs
# See Also
RevitAPIPostEventArgs Members
Autodesk.Revit.DB.Events Namespace